espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/touch_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** RTC_TOUCH_INT_RAW_REG register
 *  need_des
 */
#define RTC_TOUCH_INT_RAW_REG (DR_REG_LP_TOUCH_BASE + 0x0)
/** RTC_TOUCH_SCAN_DONE_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SCAN_DONE_INT_RAW    (BIT(0))
#define RTC_TOUCH_SCAN_DONE_INT_RAW_M  (RTC_TOUCH_SCAN_DONE_INT_RAW_V << RTC_TOUCH_SCAN_DONE_INT_RAW_S)
#define RTC_TOUCH_SCAN_DONE_INT_RAW_V  0x00000001U
#define RTC_TOUCH_SCAN_DONE_INT_RAW_S  0
/** RTC_TOUCH_DONE_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DONE_INT_RAW    (BIT(1))
#define RTC_TOUCH_DONE_INT_RAW_M  (RTC_TOUCH_DONE_INT_RAW_V << RTC_TOUCH_DONE_INT_RAW_S)
#define RTC_TOUCH_DONE_INT_RAW_V  0x00000001U
#define RTC_TOUCH_DONE_INT_RAW_S  1
/** RTC_TOUCH_ACTIVE_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_ACTIVE_INT_RAW    (BIT(2))
#define RTC_TOUCH_ACTIVE_INT_RAW_M  (RTC_TOUCH_ACTIVE_INT_RAW_V << RTC_TOUCH_ACTIVE_INT_RAW_S)
#define RTC_TOUCH_ACTIVE_INT_RAW_V  0x00000001U
#define RTC_TOUCH_ACTIVE_INT_RAW_S  2
/** RTC_TOUCH_INACTIVE_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_INACTIVE_INT_RAW    (BIT(3))
#define RTC_TOUCH_INACTIVE_INT_RAW_M  (RTC_TOUCH_INACTIVE_INT_RAW_V << RTC_TOUCH_INACTIVE_INT_RAW_S)
#define RTC_TOUCH_INACTIVE_INT_RAW_V  0x00000001U
#define RTC_TOUCH_INACTIVE_INT_RAW_S  3
/** RTC_TOUCH_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_TIMEOUT_INT_RAW    (BIT(4))
#define RTC_TOUCH_TIMEOUT_INT_RAW_M  (RTC_TOUCH_TIMEOUT_INT_RAW_V << RTC_TOUCH_TIMEOUT_INT_RAW_S)
#define RTC_TOUCH_TIMEOUT_INT_RAW_V  0x00000001U
#define RTC_TOUCH_TIMEOUT_INT_RAW_S  4
/** RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW    (BIT(5))
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_M  (RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_V << RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_S)
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_V  0x00000001U
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_S  5
/** RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW    (BIT(6))
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW_M  (RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW_V << RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW_S)
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW_V  0x00000001U
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_RAW_S  6

/** RTC_TOUCH_INT_ST_REG register
 *  need_des
 */
#define RTC_TOUCH_INT_ST_REG (DR_REG_LP_TOUCH_BASE + 0x4)
/** RTC_TOUCH_SCAN_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SCAN_DONE_INT_ST    (BIT(0))
#define RTC_TOUCH_SCAN_DONE_INT_ST_M  (RTC_TOUCH_SCAN_DONE_INT_ST_V << RTC_TOUCH_SCAN_DONE_INT_ST_S)
#define RTC_TOUCH_SCAN_DONE_INT_ST_V  0x00000001U
#define RTC_TOUCH_SCAN_DONE_INT_ST_S  0
/** RTC_TOUCH_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DONE_INT_ST    (BIT(1))
#define RTC_TOUCH_DONE_INT_ST_M  (RTC_TOUCH_DONE_INT_ST_V << RTC_TOUCH_DONE_INT_ST_S)
#define RTC_TOUCH_DONE_INT_ST_V  0x00000001U
#define RTC_TOUCH_DONE_INT_ST_S  1
/** RTC_TOUCH_ACTIVE_INT_ST : RO; bitpos: [2]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_ACTIVE_INT_ST    (BIT(2))
#define RTC_TOUCH_ACTIVE_INT_ST_M  (RTC_TOUCH_ACTIVE_INT_ST_V << RTC_TOUCH_ACTIVE_INT_ST_S)
#define RTC_TOUCH_ACTIVE_INT_ST_V  0x00000001U
#define RTC_TOUCH_ACTIVE_INT_ST_S  2
/** RTC_TOUCH_INACTIVE_INT_ST : RO; bitpos: [3]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_INACTIVE_INT_ST    (BIT(3))
#define RTC_TOUCH_INACTIVE_INT_ST_M  (RTC_TOUCH_INACTIVE_INT_ST_V << RTC_TOUCH_INACTIVE_INT_ST_S)
#define RTC_TOUCH_INACTIVE_INT_ST_V  0x00000001U
#define RTC_TOUCH_INACTIVE_INT_ST_S  3
/** RTC_TOUCH_TIMEOUT_INT_ST : RO; bitpos: [4]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_TIMEOUT_INT_ST    (BIT(4))
#define RTC_TOUCH_TIMEOUT_INT_ST_M  (RTC_TOUCH_TIMEOUT_INT_ST_V << RTC_TOUCH_TIMEOUT_INT_ST_S)
#define RTC_TOUCH_TIMEOUT_INT_ST_V  0x00000001U
#define RTC_TOUCH_TIMEOUT_INT_ST_S  4
/** RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST : RO; bitpos: [5]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST    (BIT(5))
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_M  (RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_V << RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_S)
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_V  0x00000001U
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_S  5
/** RTC_TOUCH_BENCHMARK_UPDATE_INT_ST : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ST    (BIT(6))
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ST_M  (RTC_TOUCH_BENCHMARK_UPDATE_INT_ST_V << RTC_TOUCH_BENCHMARK_UPDATE_INT_ST_S)
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ST_V  0x00000001U
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ST_S  6

/** RTC_TOUCH_INT_ENA_REG register
 *  need_des
 */
#define RTC_TOUCH_INT_ENA_REG (DR_REG_LP_TOUCH_BASE + 0x8)
/** RTC_TOUCH_SCAN_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SCAN_DONE_INT_ENA    (BIT(0))
#define RTC_TOUCH_SCAN_DONE_INT_ENA_M  (RTC_TOUCH_SCAN_DONE_INT_ENA_V << RTC_TOUCH_SCAN_DONE_INT_ENA_S)
#define RTC_TOUCH_SCAN_DONE_INT_ENA_V  0x00000001U
#define RTC_TOUCH_SCAN_DONE_INT_ENA_S  0
/** RTC_TOUCH_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DONE_INT_ENA    (BIT(1))
#define RTC_TOUCH_DONE_INT_ENA_M  (RTC_TOUCH_DONE_INT_ENA_V << RTC_TOUCH_DONE_INT_ENA_S)
#define RTC_TOUCH_DONE_INT_ENA_V  0x00000001U
#define RTC_TOUCH_DONE_INT_ENA_S  1
/** RTC_TOUCH_ACTIVE_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_ACTIVE_INT_ENA    (BIT(2))
#define RTC_TOUCH_ACTIVE_INT_ENA_M  (RTC_TOUCH_ACTIVE_INT_ENA_V << RTC_TOUCH_ACTIVE_INT_ENA_S)
#define RTC_TOUCH_ACTIVE_INT_ENA_V  0x00000001U
#define RTC_TOUCH_ACTIVE_INT_ENA_S  2
/** RTC_TOUCH_INACTIVE_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_INACTIVE_INT_ENA    (BIT(3))
#define RTC_TOUCH_INACTIVE_INT_ENA_M  (RTC_TOUCH_INACTIVE_INT_ENA_V << RTC_TOUCH_INACTIVE_INT_ENA_S)
#define RTC_TOUCH_INACTIVE_INT_ENA_V  0x00000001U
#define RTC_TOUCH_INACTIVE_INT_ENA_S  3
/** RTC_TOUCH_TIMEOUT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_TIMEOUT_INT_ENA    (BIT(4))
#define RTC_TOUCH_TIMEOUT_INT_ENA_M  (RTC_TOUCH_TIMEOUT_INT_ENA_V << RTC_TOUCH_TIMEOUT_INT_ENA_S)
#define RTC_TOUCH_TIMEOUT_INT_ENA_V  0x00000001U
#define RTC_TOUCH_TIMEOUT_INT_ENA_S  4
/** RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA    (BIT(5))
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_M  (RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_V << RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_S)
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_V  0x00000001U
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_S  5
/** RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA    (BIT(6))
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA_M  (RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA_V << RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA_S)
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA_V  0x00000001U
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_ENA_S  6

