espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/touch_reg.h
/** RTC_TOUCH_INT_CLR_REG register
 *  need_des
 */
#define RTC_TOUCH_INT_CLR_REG (DR_REG_LP_TOUCH_BASE + 0xc)
/** RTC_TOUCH_SCAN_DONE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SCAN_DONE_INT_CLR    (BIT(0))
#define RTC_TOUCH_SCAN_DONE_INT_CLR_M  (RTC_TOUCH_SCAN_DONE_INT_CLR_V << RTC_TOUCH_SCAN_DONE_INT_CLR_S)
#define RTC_TOUCH_SCAN_DONE_INT_CLR_V  0x00000001U
#define RTC_TOUCH_SCAN_DONE_INT_CLR_S  0
/** RTC_TOUCH_DONE_INT_CLR : WT; bitpos: [1]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DONE_INT_CLR    (BIT(1))
#define RTC_TOUCH_DONE_INT_CLR_M  (RTC_TOUCH_DONE_INT_CLR_V << RTC_TOUCH_DONE_INT_CLR_S)
#define RTC_TOUCH_DONE_INT_CLR_V  0x00000001U
#define RTC_TOUCH_DONE_INT_CLR_S  1
/** RTC_TOUCH_ACTIVE_INT_CLR : WT; bitpos: [2]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_ACTIVE_INT_CLR    (BIT(2))
#define RTC_TOUCH_ACTIVE_INT_CLR_M  (RTC_TOUCH_ACTIVE_INT_CLR_V << RTC_TOUCH_ACTIVE_INT_CLR_S)
#define RTC_TOUCH_ACTIVE_INT_CLR_V  0x00000001U
#define RTC_TOUCH_ACTIVE_INT_CLR_S  2
/** RTC_TOUCH_INACTIVE_INT_CLR : WT; bitpos: [3]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_INACTIVE_INT_CLR    (BIT(3))
#define RTC_TOUCH_INACTIVE_INT_CLR_M  (RTC_TOUCH_INACTIVE_INT_CLR_V << RTC_TOUCH_INACTIVE_INT_CLR_S)
#define RTC_TOUCH_INACTIVE_INT_CLR_V  0x00000001U
#define RTC_TOUCH_INACTIVE_INT_CLR_S  3
/** RTC_TOUCH_TIMEOUT_INT_CLR : WT; bitpos: [4]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_TIMEOUT_INT_CLR    (BIT(4))
#define RTC_TOUCH_TIMEOUT_INT_CLR_M  (RTC_TOUCH_TIMEOUT_INT_CLR_V << RTC_TOUCH_TIMEOUT_INT_CLR_S)
#define RTC_TOUCH_TIMEOUT_INT_CLR_V  0x00000001U
#define RTC_TOUCH_TIMEOUT_INT_CLR_S  4
/** RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR : WT; bitpos: [5]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR    (BIT(5))
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_M  (RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_V << RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_S)
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_V  0x00000001U
#define RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_S  5
/** RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR : WT; bitpos: [6]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR    (BIT(6))
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR_M  (RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR_V << RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR_S)
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR_V  0x00000001U
#define RTC_TOUCH_BENCHMARK_UPDATE_INT_CLR_S  6

/** RTC_TOUCH_CHN_STATUS_REG register
 *  need_des
 */
#define RTC_TOUCH_CHN_STATUS_REG (DR_REG_LP_TOUCH_BASE + 0x10)
/** RTC_TOUCH_PAD_ACTIVE : RO; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD_ACTIVE    0x00007FFFU
#define RTC_TOUCH_PAD_ACTIVE_M  (RTC_TOUCH_PAD_ACTIVE_V << RTC_TOUCH_PAD_ACTIVE_S)
#define RTC_TOUCH_PAD_ACTIVE_V  0x00007FFFU
#define RTC_TOUCH_PAD_ACTIVE_S  0
/** RTC_TOUCH_MEAS_DONE : RO; bitpos: [15]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_MEAS_DONE    (BIT(15))
#define RTC_TOUCH_MEAS_DONE_M  (RTC_TOUCH_MEAS_DONE_V << RTC_TOUCH_MEAS_DONE_S)
#define RTC_TOUCH_MEAS_DONE_V  0x00000001U
#define RTC_TOUCH_MEAS_DONE_S  15
/** RTC_TOUCH_SCAN_CURR : RO; bitpos: [19:16]; default: 15;
 *  need_des
 */
#define RTC_TOUCH_SCAN_CURR    0x0000000FU
#define RTC_TOUCH_SCAN_CURR_M  (RTC_TOUCH_SCAN_CURR_V << RTC_TOUCH_SCAN_CURR_S)
#define RTC_TOUCH_SCAN_CURR_V  0x0000000FU
#define RTC_TOUCH_SCAN_CURR_S  16

/** RTC_TOUCH_STATUS_0_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_0_REG (DR_REG_LP_TOUCH_BASE + 0x14)
/** RTC_TOUCH_PAD0_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD0_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD0_DATA_M  (RTC_TOUCH_PAD0_DATA_V << RTC_TOUCH_PAD0_DATA_S)
#define RTC_TOUCH_PAD0_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD0_DATA_S  0
/** RTC_TOUCH_PAD0_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD0_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD0_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD0_DEBOUNCE_CNT_V << RTC_TOUCH_PAD0_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD0_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD0_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD0_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD0_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD0_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD0_NEG_NOISE_CNT_V << RTC_TOUCH_PAD0_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD0_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD0_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_1_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_1_REG (DR_REG_LP_TOUCH_BASE + 0x18)
/** RTC_TOUCH_PAD1_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD1_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD1_DATA_M  (RTC_TOUCH_PAD1_DATA_V << RTC_TOUCH_PAD1_DATA_S)
#define RTC_TOUCH_PAD1_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD1_DATA_S  0
/** RTC_TOUCH_PAD1_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD1_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD1_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD1_DEBOUNCE_CNT_V << RTC_TOUCH_PAD1_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD1_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD1_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD1_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD1_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD1_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD1_NEG_NOISE_CNT_V << RTC_TOUCH_PAD1_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD1_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD1_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_2_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_2_REG (DR_REG_LP_TOUCH_BASE + 0x1c)
/** RTC_TOUCH_PAD2_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD2_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD2_DATA_M  (RTC_TOUCH_PAD2_DATA_V << RTC_TOUCH_PAD2_DATA_S)
#define RTC_TOUCH_PAD2_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD2_DATA_S  0
/** RTC_TOUCH_PAD2_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD2_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD2_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD2_DEBOUNCE_CNT_V << RTC_TOUCH_PAD2_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD2_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD2_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD2_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD2_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD2_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD2_NEG_NOISE_CNT_V << RTC_TOUCH_PAD2_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD2_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD2_NEG_NOISE_CNT_S  19

