espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/touch_reg.h
/** RTC_TOUCH_STATUS_3_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_3_REG (DR_REG_LP_TOUCH_BASE + 0x20)
/** RTC_TOUCH_PAD3_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD3_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD3_DATA_M  (RTC_TOUCH_PAD3_DATA_V << RTC_TOUCH_PAD3_DATA_S)
#define RTC_TOUCH_PAD3_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD3_DATA_S  0
/** RTC_TOUCH_PAD3_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD3_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD3_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD3_DEBOUNCE_CNT_V << RTC_TOUCH_PAD3_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD3_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD3_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD3_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD3_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD3_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD3_NEG_NOISE_CNT_V << RTC_TOUCH_PAD3_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD3_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD3_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_4_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_4_REG (DR_REG_LP_TOUCH_BASE + 0x24)
/** RTC_TOUCH_PAD4_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD4_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD4_DATA_M  (RTC_TOUCH_PAD4_DATA_V << RTC_TOUCH_PAD4_DATA_S)
#define RTC_TOUCH_PAD4_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD4_DATA_S  0
/** RTC_TOUCH_PAD4_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD4_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD4_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD4_DEBOUNCE_CNT_V << RTC_TOUCH_PAD4_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD4_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD4_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD4_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD4_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD4_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD4_NEG_NOISE_CNT_V << RTC_TOUCH_PAD4_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD4_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD4_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_5_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_5_REG (DR_REG_LP_TOUCH_BASE + 0x28)
/** RTC_TOUCH_PAD5_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD5_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD5_DATA_M  (RTC_TOUCH_PAD5_DATA_V << RTC_TOUCH_PAD5_DATA_S)
#define RTC_TOUCH_PAD5_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD5_DATA_S  0
/** RTC_TOUCH_PAD5_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD5_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD5_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD5_DEBOUNCE_CNT_V << RTC_TOUCH_PAD5_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD5_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD5_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD5_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD5_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD5_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD5_NEG_NOISE_CNT_V << RTC_TOUCH_PAD5_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD5_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD5_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_6_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_6_REG (DR_REG_LP_TOUCH_BASE + 0x2c)
/** RTC_TOUCH_PAD6_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD6_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD6_DATA_M  (RTC_TOUCH_PAD6_DATA_V << RTC_TOUCH_PAD6_DATA_S)
#define RTC_TOUCH_PAD6_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD6_DATA_S  0
/** RTC_TOUCH_PAD6_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD6_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD6_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD6_DEBOUNCE_CNT_V << RTC_TOUCH_PAD6_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD6_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD6_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD6_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD6_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD6_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD6_NEG_NOISE_CNT_V << RTC_TOUCH_PAD6_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD6_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD6_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_7_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_7_REG (DR_REG_LP_TOUCH_BASE + 0x30)
/** RTC_TOUCH_PAD7_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD7_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD7_DATA_M  (RTC_TOUCH_PAD7_DATA_V << RTC_TOUCH_PAD7_DATA_S)
#define RTC_TOUCH_PAD7_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD7_DATA_S  0
/** RTC_TOUCH_PAD7_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD7_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD7_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD7_DEBOUNCE_CNT_V << RTC_TOUCH_PAD7_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD7_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD7_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD7_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD7_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD7_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD7_NEG_NOISE_CNT_V << RTC_TOUCH_PAD7_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD7_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD7_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_8_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_8_REG (DR_REG_LP_TOUCH_BASE + 0x34)
/** RTC_TOUCH_PAD8_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD8_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD8_DATA_M  (RTC_TOUCH_PAD8_DATA_V << RTC_TOUCH_PAD8_DATA_S)
#define RTC_TOUCH_PAD8_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD8_DATA_S  0
/** RTC_TOUCH_PAD8_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD8_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD8_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD8_DEBOUNCE_CNT_V << RTC_TOUCH_PAD8_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD8_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD8_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD8_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD8_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD8_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD8_NEG_NOISE_CNT_V << RTC_TOUCH_PAD8_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD8_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD8_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_9_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_9_REG (DR_REG_LP_TOUCH_BASE + 0x38)
/** RTC_TOUCH_PAD9_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD9_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD9_DATA_M  (RTC_TOUCH_PAD9_DATA_V << RTC_TOUCH_PAD9_DATA_S)
#define RTC_TOUCH_PAD9_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD9_DATA_S  0
/** RTC_TOUCH_PAD9_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD9_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD9_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD9_DEBOUNCE_CNT_V << RTC_TOUCH_PAD9_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD9_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD9_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD9_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD9_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD9_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD9_NEG_NOISE_CNT_V << RTC_TOUCH_PAD9_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD9_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD9_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_10_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_10_REG (DR_REG_LP_TOUCH_BASE + 0x3c)
/** RTC_TOUCH_PAD10_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD10_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD10_DATA_M  (RTC_TOUCH_PAD10_DATA_V << RTC_TOUCH_PAD10_DATA_S)
#define RTC_TOUCH_PAD10_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD10_DATA_S  0
/** RTC_TOUCH_PAD10_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD10_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD10_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD10_DEBOUNCE_CNT_V << RTC_TOUCH_PAD10_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD10_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD10_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD10_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD10_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD10_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD10_NEG_NOISE_CNT_V << RTC_TOUCH_PAD10_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD10_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD10_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_11_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_11_REG (DR_REG_LP_TOUCH_BASE + 0x40)
/** RTC_TOUCH_PAD11_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD11_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD11_DATA_M  (RTC_TOUCH_PAD11_DATA_V << RTC_TOUCH_PAD11_DATA_S)
#define RTC_TOUCH_PAD11_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD11_DATA_S  0
/** RTC_TOUCH_PAD11_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD11_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD11_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD11_DEBOUNCE_CNT_V << RTC_TOUCH_PAD11_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD11_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD11_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD11_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD11_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD11_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD11_NEG_NOISE_CNT_V << RTC_TOUCH_PAD11_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD11_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD11_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_12_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_12_REG (DR_REG_LP_TOUCH_BASE + 0x44)
/** RTC_TOUCH_PAD12_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD12_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD12_DATA_M  (RTC_TOUCH_PAD12_DATA_V << RTC_TOUCH_PAD12_DATA_S)
#define RTC_TOUCH_PAD12_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD12_DATA_S  0
/** RTC_TOUCH_PAD12_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD12_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD12_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD12_DEBOUNCE_CNT_V << RTC_TOUCH_PAD12_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD12_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD12_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD12_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD12_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD12_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD12_NEG_NOISE_CNT_V << RTC_TOUCH_PAD12_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD12_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD12_NEG_NOISE_CNT_S  19

