espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/touch_reg.h
/** RTC_TOUCH_STATUS_13_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_13_REG (DR_REG_LP_TOUCH_BASE + 0x48)
/** RTC_TOUCH_PAD13_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD13_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD13_DATA_M  (RTC_TOUCH_PAD13_DATA_V << RTC_TOUCH_PAD13_DATA_S)
#define RTC_TOUCH_PAD13_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD13_DATA_S  0
/** RTC_TOUCH_PAD13_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD13_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD13_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD13_DEBOUNCE_CNT_V << RTC_TOUCH_PAD13_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD13_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD13_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD13_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD13_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD13_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD13_NEG_NOISE_CNT_V << RTC_TOUCH_PAD13_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD13_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD13_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_14_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_14_REG (DR_REG_LP_TOUCH_BASE + 0x4c)
/** RTC_TOUCH_PAD14_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD14_DATA    0x0000FFFFU
#define RTC_TOUCH_PAD14_DATA_M  (RTC_TOUCH_PAD14_DATA_V << RTC_TOUCH_PAD14_DATA_S)
#define RTC_TOUCH_PAD14_DATA_V  0x0000FFFFU
#define RTC_TOUCH_PAD14_DATA_S  0
/** RTC_TOUCH_PAD14_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD14_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_PAD14_DEBOUNCE_CNT_M  (RTC_TOUCH_PAD14_DEBOUNCE_CNT_V << RTC_TOUCH_PAD14_DEBOUNCE_CNT_S)
#define RTC_TOUCH_PAD14_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_PAD14_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_PAD14_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD14_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_PAD14_NEG_NOISE_CNT_M  (RTC_TOUCH_PAD14_NEG_NOISE_CNT_V << RTC_TOUCH_PAD14_NEG_NOISE_CNT_S)
#define RTC_TOUCH_PAD14_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_PAD14_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_15_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_15_REG (DR_REG_LP_TOUCH_BASE + 0x50)
/** RTC_TOUCH_SLP_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SLP_DATA    0x0000FFFFU
#define RTC_TOUCH_SLP_DATA_M  (RTC_TOUCH_SLP_DATA_V << RTC_TOUCH_SLP_DATA_S)
#define RTC_TOUCH_SLP_DATA_V  0x0000FFFFU
#define RTC_TOUCH_SLP_DATA_S  0
/** RTC_TOUCH_SLP_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SLP_DEBOUNCE_CNT    0x00000007U
#define RTC_TOUCH_SLP_DEBOUNCE_CNT_M  (RTC_TOUCH_SLP_DEBOUNCE_CNT_V << RTC_TOUCH_SLP_DEBOUNCE_CNT_S)
#define RTC_TOUCH_SLP_DEBOUNCE_CNT_V  0x00000007U
#define RTC_TOUCH_SLP_DEBOUNCE_CNT_S  16
/** RTC_TOUCH_SLP_NEG_NOISE_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SLP_NEG_NOISE_CNT    0x0000000FU
#define RTC_TOUCH_SLP_NEG_NOISE_CNT_M  (RTC_TOUCH_SLP_NEG_NOISE_CNT_V << RTC_TOUCH_SLP_NEG_NOISE_CNT_S)
#define RTC_TOUCH_SLP_NEG_NOISE_CNT_V  0x0000000FU
#define RTC_TOUCH_SLP_NEG_NOISE_CNT_S  19

/** RTC_TOUCH_STATUS_16_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_16_REG (DR_REG_LP_TOUCH_BASE + 0x54)
/** RTC_TOUCH_APPROACH_PAD2_CNT : RO; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_PAD2_CNT    0x000000FFU
#define RTC_TOUCH_APPROACH_PAD2_CNT_M  (RTC_TOUCH_APPROACH_PAD2_CNT_V << RTC_TOUCH_APPROACH_PAD2_CNT_S)
#define RTC_TOUCH_APPROACH_PAD2_CNT_V  0x000000FFU
#define RTC_TOUCH_APPROACH_PAD2_CNT_S  0
/** RTC_TOUCH_APPROACH_PAD1_CNT : RO; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_PAD1_CNT    0x000000FFU
#define RTC_TOUCH_APPROACH_PAD1_CNT_M  (RTC_TOUCH_APPROACH_PAD1_CNT_V << RTC_TOUCH_APPROACH_PAD1_CNT_S)
#define RTC_TOUCH_APPROACH_PAD1_CNT_V  0x000000FFU
#define RTC_TOUCH_APPROACH_PAD1_CNT_S  8
/** RTC_TOUCH_APPROACH_PAD0_CNT : RO; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_APPROACH_PAD0_CNT    0x000000FFU
#define RTC_TOUCH_APPROACH_PAD0_CNT_M  (RTC_TOUCH_APPROACH_PAD0_CNT_V << RTC_TOUCH_APPROACH_PAD0_CNT_S)
#define RTC_TOUCH_APPROACH_PAD0_CNT_V  0x000000FFU
#define RTC_TOUCH_APPROACH_PAD0_CNT_S  16
/** RTC_TOUCH_SLP_APPROACH_CNT : RO; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_SLP_APPROACH_CNT    0x000000FFU
#define RTC_TOUCH_SLP_APPROACH_CNT_M  (RTC_TOUCH_SLP_APPROACH_CNT_V << RTC_TOUCH_SLP_APPROACH_CNT_S)
#define RTC_TOUCH_SLP_APPROACH_CNT_V  0x000000FFU
#define RTC_TOUCH_SLP_APPROACH_CNT_S  24

/** RTC_TOUCH_STATUS_17_REG register
 *  need_des
 */
#define RTC_TOUCH_STATUS_17_REG (DR_REG_LP_TOUCH_BASE + 0x58)
/** RTC_TOUCH_DCAP_LPF : RO; bitpos: [6:0]; default: 0;
 *  Reserved
 */
#define RTC_TOUCH_DCAP_LPF    0x0000007FU
#define RTC_TOUCH_DCAP_LPF_M  (RTC_TOUCH_DCAP_LPF_V << RTC_TOUCH_DCAP_LPF_S)
#define RTC_TOUCH_DCAP_LPF_V  0x0000007FU
#define RTC_TOUCH_DCAP_LPF_S  0
/** RTC_TOUCH_DRES_LPF : RO; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DRES_LPF    0x00000003U
#define RTC_TOUCH_DRES_LPF_M  (RTC_TOUCH_DRES_LPF_V << RTC_TOUCH_DRES_LPF_S)
#define RTC_TOUCH_DRES_LPF_V  0x00000003U
#define RTC_TOUCH_DRES_LPF_S  7
/** RTC_TOUCH_DRV_LS : RO; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DRV_LS    0x0000000FU
#define RTC_TOUCH_DRV_LS_M  (RTC_TOUCH_DRV_LS_V << RTC_TOUCH_DRV_LS_S)
#define RTC_TOUCH_DRV_LS_V  0x0000000FU
#define RTC_TOUCH_DRV_LS_S  9
/** RTC_TOUCH_DRV_HS : RO; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DRV_HS    0x0000001FU
#define RTC_TOUCH_DRV_HS_M  (RTC_TOUCH_DRV_HS_V << RTC_TOUCH_DRV_HS_S)
#define RTC_TOUCH_DRV_HS_V  0x0000001FU
#define RTC_TOUCH_DRV_HS_S  13
/** RTC_TOUCH_DBIAS : RO; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_DBIAS    0x0000001FU
#define RTC_TOUCH_DBIAS_M  (RTC_TOUCH_DBIAS_V << RTC_TOUCH_DBIAS_S)
#define RTC_TOUCH_DBIAS_V  0x0000001FU
#define RTC_TOUCH_DBIAS_S  18
/** RTC_TOUCH_FREQ_SCAN_CNT : RO; bitpos: [24:23]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_FREQ_SCAN_CNT    0x00000003U
#define RTC_TOUCH_FREQ_SCAN_CNT_M  (RTC_TOUCH_FREQ_SCAN_CNT_V << RTC_TOUCH_FREQ_SCAN_CNT_S)
#define RTC_TOUCH_FREQ_SCAN_CNT_V  0x00000003U
#define RTC_TOUCH_FREQ_SCAN_CNT_S  23

/** RTC_TOUCH_CHN_TMP_STATUS_REG register
 *  need_des
 */
#define RTC_TOUCH_CHN_TMP_STATUS_REG (DR_REG_LP_TOUCH_BASE + 0x5c)
/** RTC_TOUCH_PAD_INACTIVE_STATUS : RO; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD_INACTIVE_STATUS    0x00007FFFU
#define RTC_TOUCH_PAD_INACTIVE_STATUS_M  (RTC_TOUCH_PAD_INACTIVE_STATUS_V << RTC_TOUCH_PAD_INACTIVE_STATUS_S)
#define RTC_TOUCH_PAD_INACTIVE_STATUS_V  0x00007FFFU
#define RTC_TOUCH_PAD_INACTIVE_STATUS_S  0
/** RTC_TOUCH_PAD_ACTIVE_STATUS : RO; bitpos: [29:15]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_PAD_ACTIVE_STATUS    0x00007FFFU
#define RTC_TOUCH_PAD_ACTIVE_STATUS_M  (RTC_TOUCH_PAD_ACTIVE_STATUS_V << RTC_TOUCH_PAD_ACTIVE_STATUS_S)
#define RTC_TOUCH_PAD_ACTIVE_STATUS_V  0x00007FFFU
#define RTC_TOUCH_PAD_ACTIVE_STATUS_S  15

/** RTC_TOUCH_DATE_REG register
 *  need_des
 */
#define RTC_TOUCH_DATE_REG (DR_REG_LP_TOUCH_BASE + 0x100)
/** RTC_TOUCH_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define RTC_TOUCH_CLK_EN    (BIT(31))
#define RTC_TOUCH_CLK_EN_M  (RTC_TOUCH_CLK_EN_V << RTC_TOUCH_CLK_EN_S)
#define RTC_TOUCH_CLK_EN_V  0x00000001U
#define RTC_TOUCH_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
